#include<stdio.h>
#include<stdlib.h>
#include<string.h>
#include"Func_Choose.c"

#define TRUE 1
#define FALSE 0
#define OK 1
#define ERROR 0
#define INFEASIBLE -1
#define OVERFLOW -2

#define N 10														//项数上限 
#define n 8															//需要操作的多项式个数 上限 
#define ope_number_upper 20											//设定操作次数上限 
typedef int Status;	
int operation=-1;													//全局变量 
/***************************************************0.退出*********************************************************************************/

 
/***************************************************1.创建**********************************************************************************/
#define max_poly 100
Status read_coefficient(int *coefficient,char number){
if(number!='.')
		*coefficient=number-'0';
	else
		*coefficient=(int)number;
	return OK; 
}
Status read_exponent(int *exponent,char number){
	if(number!='.')
		*exponent=number-'0';
	else
		*exponent=(int)number;
	return OK;
}																			//指数：字符型->整型 
/*———————————————————————————————————————————————————————————————————*/
Status monomial_store_to_polymial(char *monomial,char sign){
	int coefficient[10],exponent[10];										//分别存储系数、指数的数组。注意小数点 
	int *flag_float;														//对于一个整形数组判断是否含小数点，标记其位置 
	int i,j; 
	while(*monomial!='+'&&*monomial!='-'&&*monomial!='\n'){					//当未到一个单项式的结束位置 
		i=j=0;																//读入系数或指数之前相应整型数组尚空 
		if((*(monomial-1)=='+'||*(monomial-1)=='-')&&('9'>=*monomial>='0'||*monomial=='.')){			//系数判断 
			read_coefficient(coefficient+(i++),*monomial);
			if('z'>=*monomial>='a'||'Z'>=*monomial>='A')											//自变量判断 
				if(*monomial=='^')																	//'^'判断 
					monomial++;
					if('9'>=*monomial>='0')															//指数判断 
						read_exponent(exponent+(j++),*(monomial));
					else
						if(*monomial=='+'||*monomial=='-')
							exponent[0]=1;															//读入缺省指数 
						else
							return FALSE;
		}																	//end if
		else
			return FALSE;
		monomial++;
	}																		//end while	
	return OK;
}																			//end function 
/*————————————————————————————————————————————————————————————————————*/ 
Status creat(){
	
}
/***************************************************2.显示*********************************************************************************/
Status print(int print_obj){
	
} 
/*———————————————————————————————————————————————————————————————————*/
Status print_all(){
	int i;
	for(i=0;i<n+1;i++)
		print(i);
	return OK;	
}
/*———————————————————————————————————————————————————————————————————*/

Status Print(){
	int print_obj[n+1];
	printf("请输入想要显示的多项式序号:1-%d,%d表示显示所有\n",n，n+1);
	for(i=0;i<n;i++){
		scanf("%d",print_obj[i-1]);
		if(print_obj[i]==n+1)
			print_all();
		else
			print(print_obj[i-1]);
	} 
	return OK;
}

/***************************************************3.复制**********************************************************************************/

/***************************************************4.求和*********************************************************************************/

/***************************************************5.求差**********************************************************************************/

/***************************************************6.求积*********************************************************************************/

/***************************************************7.销毁*********************************************************************************/

/***************************************************8.清空*********************************************************************************/

/***************************************************9.修改**********************************************************************************/
/***************************************************10.求商*********************************************************************************/
/***************************************************11.乘方**********************************************************************************/
/***************************************************12.N阶导函数*****************************************************************************/
/***************************************************13.不定积分******************************************************************************/
/***************************************************14.定积分*********************************************************************************/
/***************************************************15.最大公约式*****************************************************************************/
/***************************************************16.最小公倍式****************************************************************************/
/***************************************************main**********************************************************************************/
int main(){ 
	struct  MNode{
		float coeffcient;
		float exponent; 
		struct MNnode *next;											//	MNode next;
	} *polys[n];														//存储头指针的数组		#define n 8 

	int i; 
	int ope_number_th;														//操作次数   #define ope_number_upper 20 
	int operation;															//执行操作 的代号数字 
	for(i=0;i<n;i++){													//指针数组初始化&输出运行情况 								 
		polys[i]=(struct MNode *)malloc(sizeof(struct MNode));
		printf("%s\n",polys[i]?"yes":"NULL");
	}																	//end for
/*———————————————————————begin your game—————————————————————————————————————————————*/ 
	for(ope_number_th=1;ope_number_th<ope_number_upper;ope_number_th++){
		ope_call(*operation);
	}
	return OK;
}																	//end main
